// // Задание 1



// // 1.Создайте три переменные. Строки. В Них запишите любые цифровые значения (например как “12”).
// // 2.Напишите функцию считающую объем. Функция принимает три параметра, 
// // перемножает их и возвращает результат.
// // 3.Добавьте в функцию проверку типа параметров
// // a.Нам для перемножения нужны цифры, но в параметры могут попасть и строки с числами ( как это случилось
// //      с переменными из пункта 1 )
// // b.Чтобы быстро обезопасить себя от неправильных типов данных, в теле функции при перемножении добавьте
// //  параметрам преобразование к числу. Если это и так будет числом, ничего не поменяется. 
// //  Если это будет строка, она гарантированно превратится в число.
// // 4.Создайте переменную result и запишите в неё результат вызова нашей функции
// //  с тремя переменными из пункта 1.
// // 5.Выведите result в консоль.


// // let a = '6';
// // let b = '66';
// // let c = '666';

// // function task1(a, b, c) {

// //     return +a * +b * +c



// // }


// // let result = task1(a, b, c)
// // console.log(result)



// let a = 10;
// let b = 20;

// function task2(a, b) {
//     if (a < b) {
//         return a
//     } else
//         return false

// }
// let result = task2(a, b)
// console.log(result)